[
    {
      "level": 1,
      "title": "Introduction",
      "slides": [
        {
          "id": 1,
          "content": [
            {
              "type": "text",
              "value": "In the last 25 years, exoplanetology has become an integral part of astronomy and astrophysics, rapidly growing in interest and importance."
            },
            {
              "type": "text",
              "value": "This chapter discusses the impact and interest of exoplanets in both professional domains and society, including citizen science projects and media interactions."
            }
          ]
        }
      ]
    },
    {
      "level": 2,
      "title": "Exoplanet Research: A History of Discovery",
      "slides": [
        {
          "id": 1,
          "content": [
            {
              "type": "text",
              "value": "The idea of countless worlds dates back to ancient Greece, evolving into real science in the 20th century with the discovery of the first exoplanets in the 1990s."
            }
          ]
        },
        {
          "id": 2,
          "content": [
            {
              "type": "text",
              "value": "This section explores improvements in Doppler measurements from the 1950s to the 1970s that laid the groundwork for future discoveries."
            }
          ]
        },
        {
          "id": 3,
          "content": [
            {
              "type": "text",
              "value": "The significance of HD 114762 b in the context of exoplanet discoveries."
            }
          ]
        },
        {
          "id": 4,
          "content": [
            {
              "type": "text",
              "value": "Details the discoveries of 51 Peg b, 70 Vir b, and 47 UMa b and their implications for astronomy."
            }
          ]
        }
      ]
    },
    {
      "level": 3,
      "title": "PSR B1257+12 and the First Confirmed Planets Beyond the Solar System",
      "slides": [
        {
          "id": 1,
          "content": [
            {
              "type": "text",
              "value": "The discovery of PSR B1257+12's planets marked a significant milestone in exoplanet research."
            }
          ]
        },
        {
          "id": 2,
          "content": [
            {
              "type": "text",
              "value": "Explains the technique used to detect planets through variations in pulse arrival times."
            }
          ]
        },
        {
          "id": 3,
          "content": [
            {
              "type": "text",
              "value": "Details the confirmation of the planets orbiting PSR B1257+12 and their characteristics."
            }
          ]
        }
      ]
    },
    {
      "level": 4,
      "title": "The Naming of Extrasolar Planets",
      "slides": [
        {
          "id": 1,
          "content": [
            {
              "type": "text",
              "value": "Discusses the history and significance of naming astronomical objects, including exoplanets."
            }
          ]
        },
        {
          "id": 2,
          "content": [
            {
              "type": "text",
              "value": "Exoplanets inherit a complex naming system based on their host stars, established by the IAU."
            },
            {
              "type": "text",
              "value": "The first exoplanet discovered was PSR B1257+12 b."
            }
          ]
        },
        {
          "id": 3,
          "content": [
            {
              "type": "text",
              "value": "Outlines the IAU-sanctioned rules for exoplanet naming, including the hierarchy of suffixes."
            }
          ]
        }
      ]
    }
]
